Revit 2026 API

# ReferenceIntersectorSetTargetElementIds Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetTargetElementIds(
	ICollection<ElementId> elementIds
)
```
```vb
Public Sub SetTargetElementIds (
	elementIds As ICollection(Of ElementId)
)
```
```cpp
public:
void SetTargetElementIds(
	ICollection<ElementId^>^ elementIds
)
```
```fsharp
member SetTargetElementIds :
        elementIds : ICollection<ElementId> -> unit
```

#### Parameters

elementIds ICollectionElementId

#### Reference

ReferenceIntersector Class

Autodesk.Revit.DB Namespace